ir_version: 8
producer_name: "tf2onnx+onnx_optimizer"
producer_version: "1.9.3+0.10"
model_version: 0
graph {
  name: "tf2onnx"
  node {
    input: "input_1:0"
    output: "conv2d_1/BiasAdd__6:0"
    name: "conv2d_1/BiasAdd__6"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2d_1/BiasAdd__6:0"
    input: "conv2d_1/kernel/read:0"
    input: "conv2d_1/bias/read:0"
    output: "conv2d_1/BiasAdd:0"
    name: "conv2d_1/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_1/BiasAdd:0"
    output: "conv2d_1/Relu:0"
    name: "conv2d_1/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_1/Relu:0"
    input: "conv2d_2/kernel/read:0"
    input: "conv2d_2/bias/read:0"
    output: "conv2d_2/BiasAdd:0"
    name: "conv2d_2/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_2/BiasAdd:0"
    output: "conv2d_2/Relu:0"
    name: "conv2d_2/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_2/Relu:0"
    input: "conv2d_3/kernel/read:0"
    input: "conv2d_3/bias/read:0"
    output: "conv2d_3/BiasAdd:0"
    name: "conv2d_3/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_3/BiasAdd:0"
    output: "conv2d_3/Relu:0"
    name: "conv2d_3/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_3/Relu:0"
    input: "conv2d_4/kernel/read:0"
    input: "conv2d_4/bias/read:0"
    output: "conv2d_4/BiasAdd:0"
    name: "conv2d_4/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_4/BiasAdd:0"
    output: "conv2d_4/Relu:0"
    name: "conv2d_4/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_4/Relu:0"
    input: "conv2d_5/kernel/read:0"
    input: "conv2d_5/bias/read:0"
    output: "conv2d_5/BiasAdd:0"
    name: "conv2d_5/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_5/BiasAdd:0"
    output: "conv2d_5/Relu:0"
    name: "conv2d_5/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_5/Relu:0"
    input: "conv2d_6/kernel/read:0"
    input: "conv2d_6/bias/read:0"
    output: "conv2d_6/BiasAdd:0"
    name: "conv2d_6/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_6/BiasAdd:0"
    output: "conv2d_6/Relu:0"
    name: "conv2d_6/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_6/Relu:0"
    input: "conv2d_7/kernel/read:0"
    input: "conv2d_7/bias/read:0"
    output: "conv2d_7/BiasAdd:0"
    name: "conv2d_7/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_7/BiasAdd:0"
    output: "conv2d_7/Relu:0"
    name: "conv2d_7/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_7/Relu:0"
    output: "Shape__6251:0"
    name: "Shape__6251"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "Shape__6251:0"
    input: "Const__7261"
    output: "up_sampling2d_1/Shape:0"
    name: "Gather__6256"
    op_type: "Gather"
    domain: ""
  }
  node {
    input: "Shape__6251:0"
    input: "zero__2713"
    input: "const_ends__2332"
    output: "Slice__78:0"
    name: "Slice__78"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_1/Shape:0"
    output: "up_sampling2d_1/Shape__62:0"
    name: "up_sampling2d_1/Shape__62"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "up_sampling2d_1/Shape__62:0"
    input: "const_ends__2170"
    input: "const_ends__573"
    input: "zero__2713"
    output: "up_sampling2d_1/strided_slice:0"
    name: "up_sampling2d_1/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_1/strided_slice:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "up_sampling2d_1/mul:0"
    name: "up_sampling2d_1/mul"
    op_type: "Mul"
  }
  node {
    input: "up_sampling2d_1/mul:0"
    output: "Cast__79:0"
    name: "Cast__79"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
    domain: ""
  }
  node {
    input: "Slice__78:0"
    input: "Cast__79:0"
    output: "Concat__80:0"
    name: "Concat__80"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_7/Relu:0"
    input: "const_empty_float__131"
    input: "const_empty_float__131"
    input: "Concat__80:0"
    output: "Resize__81:0"
    name: "Resize__81"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "exclude_outside"
      i: 0
      type: INT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
    domain: ""
  }
  node {
    input: "Resize__81:0"
    input: "conv2d_8/kernel/read:0"
    input: "conv2d_8/bias/read:0"
    output: "conv2d_8/BiasAdd:0"
    name: "conv2d_8/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_8/BiasAdd:0"
    output: "conv2d_8/Relu:0"
    name: "conv2d_8/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_8/Relu:0"
    input: "conv2d_6/Relu:0"
    output: "concatenate_1/concat:0"
    name: "concatenate_1/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concatenate_1/concat:0"
    output: "Shape__105:0"
    name: "Shape__105"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "Shape__105:0"
    input: "Const__7261"
    output: "up_sampling2d_2/Shape:0"
    name: "Gather__6262"
    op_type: "Gather"
    domain: ""
  }
  node {
    input: "Shape__105:0"
    input: "zero__2713"
    input: "const_ends__2332"
    output: "Slice__109:0"
    name: "Slice__109"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_2/Shape:0"
    output: "up_sampling2d_2/Shape__93:0"
    name: "up_sampling2d_2/Shape__93"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "up_sampling2d_2/Shape__93:0"
    input: "const_ends__2170"
    input: "const_ends__573"
    input: "zero__2713"
    output: "up_sampling2d_2/strided_slice:0"
    name: "up_sampling2d_2/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_2/strided_slice:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "up_sampling2d_2/mul:0"
    name: "up_sampling2d_2/mul"
    op_type: "Mul"
  }
  node {
    input: "up_sampling2d_2/mul:0"
    output: "Cast__110:0"
    name: "Cast__110"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
    domain: ""
  }
  node {
    input: "Slice__109:0"
    input: "Cast__110:0"
    output: "Concat__111:0"
    name: "Concat__111"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "concatenate_1/concat:0"
    input: "const_empty_float__131"
    input: "const_empty_float__131"
    input: "Concat__111:0"
    output: "Resize__112:0"
    name: "Resize__112"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "exclude_outside"
      i: 0
      type: INT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
    domain: ""
  }
  node {
    input: "Resize__112:0"
    input: "conv2d_9/kernel/read:0"
    input: "conv2d_9/bias/read:0"
    output: "conv2d_9/BiasAdd:0"
    name: "conv2d_9/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_9/BiasAdd:0"
    output: "conv2d_9/Relu:0"
    name: "conv2d_9/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_9/Relu:0"
    input: "conv2d_5/Relu:0"
    output: "concatenate_2/concat:0"
    name: "concatenate_2/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concatenate_2/concat:0"
    output: "Shape__136:0"
    name: "Shape__136"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "Shape__136:0"
    input: "Const__7261"
    output: "up_sampling2d_3/Shape:0"
    name: "Gather__6268"
    op_type: "Gather"
    domain: ""
  }
  node {
    input: "Shape__136:0"
    input: "zero__2713"
    input: "const_ends__2332"
    output: "Slice__140:0"
    name: "Slice__140"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_3/Shape:0"
    output: "up_sampling2d_3/Shape__124:0"
    name: "up_sampling2d_3/Shape__124"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "up_sampling2d_3/Shape__124:0"
    input: "const_ends__2170"
    input: "const_ends__573"
    input: "zero__2713"
    output: "up_sampling2d_3/strided_slice:0"
    name: "up_sampling2d_3/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_3/strided_slice:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "up_sampling2d_3/mul:0"
    name: "up_sampling2d_3/mul"
    op_type: "Mul"
  }
  node {
    input: "up_sampling2d_3/mul:0"
    output: "Cast__141:0"
    name: "Cast__141"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
    domain: ""
  }
  node {
    input: "Slice__140:0"
    input: "Cast__141:0"
    output: "Concat__142:0"
    name: "Concat__142"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "concatenate_2/concat:0"
    input: "const_empty_float__131"
    input: "const_empty_float__131"
    input: "Concat__142:0"
    output: "Resize__143:0"
    name: "Resize__143"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "exclude_outside"
      i: 0
      type: INT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
    domain: ""
  }
  node {
    input: "Resize__143:0"
    input: "conv2d_10/kernel/read:0"
    input: "conv2d_10/bias/read:0"
    output: "conv2d_10/BiasAdd:0"
    name: "conv2d_10/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_10/BiasAdd:0"
    output: "conv2d_10/Relu:0"
    name: "conv2d_10/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_10/Relu:0"
    input: "conv2d_4/Relu:0"
    output: "concatenate_3/concat:0"
    name: "concatenate_3/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concatenate_3/concat:0"
    output: "Shape__6269:0"
    name: "Shape__6269"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "Shape__6269:0"
    input: "Const__7261"
    output: "up_sampling2d_4/Shape:0"
    name: "Gather__6274"
    op_type: "Gather"
    domain: ""
  }
  node {
    input: "Shape__6269:0"
    input: "zero__2713"
    input: "const_ends__2332"
    output: "Slice__171:0"
    name: "Slice__171"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_4/Shape:0"
    output: "up_sampling2d_4/Shape__155:0"
    name: "up_sampling2d_4/Shape__155"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "up_sampling2d_4/Shape__155:0"
    input: "const_ends__2170"
    input: "const_ends__573"
    input: "zero__2713"
    output: "up_sampling2d_4/strided_slice:0"
    name: "up_sampling2d_4/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_4/strided_slice:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "up_sampling2d_4/mul:0"
    name: "up_sampling2d_4/mul"
    op_type: "Mul"
  }
  node {
    input: "up_sampling2d_4/mul:0"
    output: "Cast__172:0"
    name: "Cast__172"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
    domain: ""
  }
  node {
    input: "Slice__171:0"
    input: "Cast__172:0"
    output: "Concat__173:0"
    name: "Concat__173"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "concatenate_3/concat:0"
    input: "const_empty_float__131"
    input: "const_empty_float__131"
    input: "Concat__173:0"
    output: "Resize__174:0"
    name: "Resize__174"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "exclude_outside"
      i: 0
      type: INT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
    domain: ""
  }
  node {
    input: "Resize__174:0"
    input: "conv2d_11/kernel/read:0"
    input: "conv2d_11/bias/read:0"
    output: "conv2d_11/BiasAdd:0"
    name: "conv2d_11/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_11/BiasAdd:0"
    output: "conv2d_11/Relu:0"
    name: "conv2d_11/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_11/Relu:0"
    input: "conv2d_3/Relu:0"
    output: "concatenate_4/concat:0"
    name: "concatenate_4/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concatenate_4/concat:0"
    output: "Shape__6275:0"
    name: "Shape__6275"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "Shape__6275:0"
    input: "Const__7261"
    output: "up_sampling2d_5/Shape:0"
    name: "Gather__6280"
    op_type: "Gather"
    domain: ""
  }
  node {
    input: "Shape__6275:0"
    input: "zero__2713"
    input: "const_ends__2332"
    output: "Slice__202:0"
    name: "Slice__202"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_5/Shape:0"
    output: "up_sampling2d_5/Shape__186:0"
    name: "up_sampling2d_5/Shape__186"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "up_sampling2d_5/Shape__186:0"
    input: "const_ends__2170"
    input: "const_ends__573"
    input: "zero__2713"
    output: "up_sampling2d_5/strided_slice:0"
    name: "up_sampling2d_5/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_5/strided_slice:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "up_sampling2d_5/mul:0"
    name: "up_sampling2d_5/mul"
    op_type: "Mul"
  }
  node {
    input: "up_sampling2d_5/mul:0"
    output: "Cast__203:0"
    name: "Cast__203"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
    domain: ""
  }
  node {
    input: "Slice__202:0"
    input: "Cast__203:0"
    output: "Concat__204:0"
    name: "Concat__204"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "concatenate_4/concat:0"
    input: "const_empty_float__131"
    input: "const_empty_float__131"
    input: "Concat__204:0"
    output: "Resize__205:0"
    name: "Resize__205"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "exclude_outside"
      i: 0
      type: INT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
    domain: ""
  }
  node {
    input: "Resize__205:0"
    input: "conv2d_12/kernel/read:0"
    input: "conv2d_12/bias/read:0"
    output: "conv2d_12/BiasAdd:0"
    name: "conv2d_12/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_12/BiasAdd:0"
    output: "conv2d_12/Relu:0"
    name: "conv2d_12/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_12/Relu:0"
    input: "conv2d_2/Relu:0"
    output: "concatenate_5/concat:0"
    name: "concatenate_5/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concatenate_5/concat:0"
    output: "Shape__6281:0"
    name: "Shape__6281"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "Shape__6281:0"
    input: "Const__7261"
    output: "up_sampling2d_6/Shape:0"
    name: "Gather__6286"
    op_type: "Gather"
    domain: ""
  }
  node {
    input: "Shape__6281:0"
    input: "zero__2713"
    input: "const_ends__2332"
    output: "Slice__233:0"
    name: "Slice__233"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_6/Shape:0"
    output: "up_sampling2d_6/Shape__217:0"
    name: "up_sampling2d_6/Shape__217"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "up_sampling2d_6/Shape__217:0"
    input: "const_ends__2170"
    input: "const_ends__573"
    input: "zero__2713"
    output: "up_sampling2d_6/strided_slice:0"
    name: "up_sampling2d_6/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_6/strided_slice:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "up_sampling2d_6/mul:0"
    name: "up_sampling2d_6/mul"
    op_type: "Mul"
  }
  node {
    input: "up_sampling2d_6/mul:0"
    output: "Cast__234:0"
    name: "Cast__234"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
    domain: ""
  }
  node {
    input: "Slice__233:0"
    input: "Cast__234:0"
    output: "Concat__235:0"
    name: "Concat__235"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "concatenate_5/concat:0"
    input: "const_empty_float__131"
    input: "const_empty_float__131"
    input: "Concat__235:0"
    output: "Resize__236:0"
    name: "Resize__236"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "exclude_outside"
      i: 0
      type: INT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
    domain: ""
  }
  node {
    input: "Resize__236:0"
    input: "conv2d_13/kernel/read:0"
    input: "conv2d_13/bias/read:0"
    output: "conv2d_13/BiasAdd:0"
    name: "conv2d_13/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_13/BiasAdd:0"
    output: "conv2d_13/Relu:0"
    name: "conv2d_13/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_13/Relu:0"
    input: "conv2d_1/Relu:0"
    output: "concatenate_6/concat:0"
    name: "concatenate_6/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concatenate_6/concat:0"
    output: "Shape__260:0"
    name: "Shape__260"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "Shape__260:0"
    input: "Const__7261"
    output: "up_sampling2d_7/Shape:0"
    name: "Gather__6292"
    op_type: "Gather"
    domain: ""
  }
  node {
    input: "Shape__260:0"
    input: "zero__2713"
    input: "const_ends__2332"
    output: "Slice__264:0"
    name: "Slice__264"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_7/Shape:0"
    output: "up_sampling2d_7/Shape__248:0"
    name: "up_sampling2d_7/Shape__248"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "up_sampling2d_7/Shape__248:0"
    input: "const_ends__2170"
    input: "const_ends__573"
    input: "zero__2713"
    output: "up_sampling2d_7/strided_slice:0"
    name: "up_sampling2d_7/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "up_sampling2d_7/strided_slice:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "up_sampling2d_7/mul:0"
    name: "up_sampling2d_7/mul"
    op_type: "Mul"
  }
  node {
    input: "up_sampling2d_7/mul:0"
    output: "Cast__265:0"
    name: "Cast__265"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
    domain: ""
  }
  node {
    input: "Slice__264:0"
    input: "Cast__265:0"
    output: "Concat__266:0"
    name: "Concat__266"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "concatenate_6/concat:0"
    input: "const_empty_float__131"
    input: "const_empty_float__131"
    input: "Concat__266:0"
    output: "Resize__267:0"
    name: "Resize__267"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "exclude_outside"
      i: 0
      type: INT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
    domain: ""
  }
  node {
    input: "Resize__267:0"
    input: "conv2d_14/kernel/read:0"
    input: "conv2d_14/bias/read:0"
    output: "conv2d_14/BiasAdd:0"
    name: "conv2d_14/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_14/BiasAdd:0"
    output: "conv2d_14/Sigmoid:0"
    name: "conv2d_14/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "conv2d_14/Sigmoid:0"
    input: "conv2d_1/BiasAdd__6:0"
    output: "concatenate_7/concat:0"
    name: "concatenate_7/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concatenate_7/concat:0"
    input: "const_starts__282"
    input: "const_ends__283"
    input: "Const__7261"
    output: "lambda_1/strided_slice:0"
    name: "lambda_1/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "concatenate_7/concat:0"
    input: "const_starts__279"
    input: "const_ends__280"
    input: "Const__7261"
    output: "lambda_1/strided_slice_1:0"
    name: "lambda_1/strided_slice_1"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "const_fold_opt__7632"
    input: "lambda_1/strided_slice:0"
    output: "lambda_1/add:0"
    name: "lambda_1/add"
    op_type: "Sub"
  }
  node {
    input: "lambda_1/strided_slice_1:0"
    output: "Transpose__6313:0"
    name: "Transpose__6313"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "lambda_1/add:0"
    input: "Transpose__7081_shape__7703"
    output: "Transpose__7081:0"
    name: "Transpose__7081"
    op_type: "Reshape"
    domain: ""
  }
  node {
    input: "Transpose__7081:0"
    output: "Squeeze__7702:0"
    name: "Squeeze__7702"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "Transpose__6313:0"
    input: "Squeeze__7702:0"
    output: "lambda_1/truediv:0"
    name: "lambda_1/truediv"
    op_type: "Div"
  }
  node {
    input: "lambda_1/truediv:0"
    output: "fem1/BiasAdd__285:0"
    name: "fem1/BiasAdd__285"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "fem1/BiasAdd__285:0"
    input: "fem1/kernel/read:0"
    input: "fem1/bias/read:0"
    output: "fem1/BiasAdd:0"
    name: "fem1/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "fem1/BiasAdd:0"
    output: "fem1/Relu:0"
    name: "fem1/Relu"
    op_type: "Relu"
  }
  node {
    input: "fem1/Relu:0"
    input: "conv2d_15/kernel/read:0"
    input: "conv2d_15/bias/read:0"
    output: "conv2d_15/BiasAdd:0"
    name: "conv2d_15/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "fem1/Relu:0"
    input: "fem2/kernel/read:0"
    input: "fem2/bias/read:0"
    output: "fem2/BiasAdd:0"
    name: "fem2/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_15/BiasAdd:0"
    output: "conv2d_15/Relu:0"
    name: "conv2d_15/Relu"
    op_type: "Relu"
  }
  node {
    input: "fem2/BiasAdd:0"
    output: "fem2/Relu:0"
    name: "fem2/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_15/Relu:0"
    output: "Shape__6455:0"
    name: "Shape__6455"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "fem2/Relu:0"
    input: "conv2d_24/kernel/read:0"
    input: "conv2d_24/bias/read:0"
    output: "conv2d_24/BiasAdd:0"
    name: "conv2d_24/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "fem2/Relu:0"
    input: "fem3/kernel/read:0"
    input: "fem3/bias/read:0"
    output: "fem3/BiasAdd:0"
    name: "fem3/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Shape__6455:0"
    input: "Const__7261"
    output: "conv2d_16/convolution/Shape:0"
    name: "Gather__6460"
    op_type: "Gather"
    domain: ""
  }
  node {
    input: "conv2d_24/BiasAdd:0"
    output: "conv2d_24/Relu:0"
    name: "conv2d_24/Relu"
    op_type: "Relu"
  }
  node {
    input: "fem3/BiasAdd:0"
    output: "fem3/Relu:0"
    name: "fem3/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_16/convolution/Shape:0"
    output: "conv2d_16/convolution/Shape__1249:0"
    name: "conv2d_16/convolution/Shape__1249"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "conv2d_24/Relu:0"
    output: "Shape__6445:0"
    name: "Shape__6445"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "fem3/Relu:0"
    input: "conv2d_31/kernel/read:0"
    input: "conv2d_31/bias/read:0"
    output: "conv2d_31/BiasAdd:0"
    name: "conv2d_31/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "fem3/Relu:0"
    input: "fem4/kernel/read:0"
    input: "fem4/bias/read:0"
    output: "fem4/BiasAdd:0"
    name: "fem4/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_16/convolution/Shape__1249:0"
    input: "const_ends__2170"
    input: "const_ends__2332"
    input: "zero__2713"
    output: "conv2d_16/convolution/strided_slice:0"
    name: "conv2d_16/convolution/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "conv2d_16/convolution/Shape__1249:0"
    input: "const_ends__2332"
    input: "const_ends__573"
    input: "zero__2713"
    output: "conv2d_16/convolution/strided_slice_1:0"
    name: "conv2d_16/convolution/strided_slice_1"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "Shape__6445:0"
    input: "Const__7261"
    output: "conv2d_25/convolution/Shape:0"
    name: "Gather__6450"
    op_type: "Gather"
    domain: ""
  }
  node {
    input: "conv2d_31/BiasAdd:0"
    output: "conv2d_31/Relu:0"
    name: "conv2d_31/Relu"
    op_type: "Relu"
  }
  node {
    input: "fem4/BiasAdd:0"
    output: "fem4/Relu:0"
    name: "fem4/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_16/convolution/strided_slice:0"
    input: "conv2d_16/convolution/strided_slice_1:0"
    output: "conv2d_16/convolution/stack_1_Concat__1260:0"
    name: "conv2d_16/convolution/stack_1_Concat__1260"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_25/convolution/Shape:0"
    output: "conv2d_25/convolution/Shape__807:0"
    name: "conv2d_25/convolution/Shape__807"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "conv2d_31/Relu:0"
    input: "conv2d_32/kernel/read:0"
    input: "conv2d_32/bias/read:0"
    output: "conv2d_32/BiasAdd:0"
    name: "conv2d_32/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "fem4/Relu:0"
    input: "conv2d_35/kernel/read:0"
    input: "conv2d_35/bias/read:0"
    output: "conv2d_35/BiasAdd:0"
    name: "conv2d_35/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "fem4/Relu:0"
    input: "fem5/kernel/read:0"
    input: "fem5/bias/read:0"
    output: "fem5/BiasAdd:0"
    name: "fem5/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_16/convolution/stack_1_Concat__1260:0"
    input: "conv2d_52/convolution/required_space_to_batch_paddings/strided_slice_1:0"
    output: "conv2d_16/convolution/required_space_to_batch_paddings/add_1:0"
    name: "conv2d_16/convolution/required_space_to_batch_paddings/add_1"
    op_type: "Add"
  }
  node {
    input: "conv2d_25/convolution/Shape__807:0"
    input: "const_ends__2170"
    input: "const_ends__2332"
    input: "zero__2713"
    output: "conv2d_25/convolution/strided_slice:0"
    name: "conv2d_25/convolution/strided_slice"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "conv2d_25/convolution/Shape__807:0"
    input: "const_ends__2332"
    input: "const_ends__573"
    input: "zero__2713"
    output: "conv2d_25/convolution/strided_slice_1:0"
    name: "conv2d_25/convolution/strided_slice_1"
    op_type: "Slice"
    domain: ""
  }
  node {
    input: "conv2d_32/BiasAdd:0"
    output: "conv2d_32/Relu:0"
    name: "conv2d_32/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_35/BiasAdd:0"
    output: "conv2d_35/Relu:0"
    name: "conv2d_35/Relu"
    op_type: "Relu"
  }
  node {
    input: "fem5/BiasAdd:0"
    output: "fem5/Relu:0"
    name: "fem5/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_16/convolution/required_space_to_batch_paddings/add_1:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "Div__1261:0"
    name: "Div__1261"
    op_type: "Div"
    domain: ""
  }
  node {
    input: "conv2d_25/convolution/strided_slice:0"
    input: "conv2d_25/convolution/strided_slice_1:0"
    output: "conv2d_25/convolution/stack_1_Concat__818:0"
    name: "conv2d_25/convolution/stack_1_Concat__818"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_32/Relu:0"
    input: "conv2d_33/kernel/read:0"
    input: "conv2d_33/bias/read:0"
    output: "conv2d_33/BiasAdd:0"
    name: "conv2d_33/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_35/Relu:0"
    input: "conv2d_36/kernel/read:0"
    input: "conv2d_36/bias/read:0"
    output: "conv2d_36/BiasAdd:0"
    name: "conv2d_36/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "fem5/Relu:0"
    input: "conv2d_39/kernel/read:0"
    input: "conv2d_39/bias/read:0"
    output: "conv2d_39/BiasAdd:0"
    name: "conv2d_39/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "fem5/Relu:0"
    input: "fem6/kernel/read:0"
    input: "fem6/bias/read:0"
    output: "fem6/BiasAdd:0"
    name: "fem6/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Div__1261:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "Mul__1262:0"
    name: "Mul__1262"
    op_type: "Mul"
    domain: ""
  }
  node {
    input: "conv2d_25/convolution/stack_1_Concat__818:0"
    input: "conv2d_25/convolution/required_space_to_batch_paddings/add:0"
    output: "conv2d_25/convolution/required_space_to_batch_paddings/add_1:0"
    name: "conv2d_25/convolution/required_space_to_batch_paddings/add_1"
    op_type: "Add"
  }
  node {
    input: "conv2d_33/BiasAdd:0"
    output: "conv2d_33/Relu:0"
    name: "conv2d_33/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_36/BiasAdd:0"
    output: "conv2d_36/Relu:0"
    name: "conv2d_36/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_39/BiasAdd:0"
    output: "conv2d_39/Relu:0"
    name: "conv2d_39/Relu"
    op_type: "Relu"
  }
  node {
    input: "fem6/BiasAdd:0"
    output: "fem6/Relu:0"
    name: "fem6/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_14/Sigmoid:0"
    input: "fem6/Relu:0"
    output: "concatenate_12/concat:0"
    name: "concatenate_12/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "conv2d_16/convolution/required_space_to_batch_paddings/add_1:0"
    input: "Mul__1262:0"
    output: "conv2d_16/convolution/required_space_to_batch_paddings/mod:0"
    name: "conv2d_16/convolution/required_space_to_batch_paddings/mod"
    op_type: "Sub"
    domain: ""
  }
  node {
    input: "conv2d_25/convolution/required_space_to_batch_paddings/add_1:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "Div__819:0"
    name: "Div__819"
    op_type: "Div"
    domain: ""
  }
  node {
    input: "conv2d_33/Relu:0"
    input: "conv2d_34/kernel/read:0"
    input: "conv2d_34/bias/read:0"
    output: "conv2d_34/BiasAdd:0"
    name: "conv2d_34/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_36/Relu:0"
    input: "conv2d_37/kernel/read:0"
    input: "conv2d_37/bias/read:0"
    output: "conv2d_37/BiasAdd:0"
    name: "conv2d_37/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_39/Relu:0"
    input: "conv2d_40/kernel/read:0"
    input: "conv2d_40/bias/read:0"
    output: "conv2d_40/BiasAdd:0"
    name: "conv2d_40/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "fem6/Relu:0"
    input: "fem7/kernel/read:0"
    input: "fem7/bias/read:0"
    output: "fem7/BiasAdd:0"
    name: "fem7/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "concatenate_12/concat:0"
    input: "conv2d_50/kernel/read:0"
    input: "conv2d_50/bias/read:0"
    output: "conv2d_50/BiasAdd:0"
    name: "conv2d_50/BiasAdd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "conv2d_62/convolution/dilation_rate:0"
    input: "conv2d_16/convolution/required_space_to_batch_paddings/mod:0"
    output: "conv2d_16/convolution/required_space_to_batch_paddings/sub:0"
    name: "conv2d_16/convolution/required_space_to_batch_paddings/sub"
    op_type: "Sub"
  }
  node {
    input: "Div__819:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "Mul__820:0"
    name: "Mul__820"
    op_type: "Mul"
    domain: ""
  }
  node {
    input: "conv2d_34/BiasAdd:0"
    output: "conv2d_34/Relu:0"
    name: "conv2d_34/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_37/BiasAdd:0"
    output: "conv2d_37/Relu:0"
    name: "conv2d_37/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_40/BiasAdd:0"
    output: "conv2d_40/Relu:0"
    name: "conv2d_40/Relu"
    op_type: "Relu"
  }
  node {
    input: "fem7/BiasAdd:0"
    output: "fem7/Relu:0"
    name: "fem7/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_50/BiasAdd:0"
    output: "conv2d_50/Relu:0"
    name: "conv2d_50/Relu"
    op_type: "Relu"
  }
  node {
    input: "conv2d_14/Sigmoid:0"
    input: "fem7/Relu:0"
    output: "concatenate_13/concat:0"
    name: "concatenate_13/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "conv2d_16/convolution/required_space_to_batch_paddings/sub:0"
    input: "conv2d_62/convolution/dilation_rate:0"
    output: "Div__1263:0"
    name: "Div__1263"
    op_type: "Div"
    domain: ""
  }
  node {
    input: "conv2d_25/convolution/required_space_to_batch_paddings/add_1:0"
    input: "Mul__820:0"
    output: "conv2d_25/convolution/required_space_to_batch_paddings/mod:0"
    name: "conv2d_25/convolution/required_space_to_batch_paddings/mod"
    op_type: "Sub"
    domain: ""
  }
  node {
    input: "conv2d_34/Relu:0"
    output: "Shape__6423:0"
    name: "Shape__6423"
    op_type: "Shape"
    domain: ""
  }
  node {
    input: "conv2d_34/Relu:0"
    input: "conv2d_transpose_3/kernel/read:0"
    output: "conv2d_transpose_3/conv2d_transpose:0"
    name: "conv2d_transpose_3/conv2d_transpose"
    op_type: "ConvTranspose"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
  }
  node {
    input: "conv2d_37/Relu:0"
    input: "conv2d_38/kernel/read:0"
    input: "conv2d_38/bias/read:0"
    output: "conv2d_38/BiasAdd:0"
